# Тема Кортеж и работа сним.
# Удалить элемент из кортежа.
# Входные данные: (1, 2, 3)
# Результат: (1, 2)

a = (1, 2, 3)
print('Input tuple:', a)
first, second, third = a
output = first, second
print('Output tuple:', output)